---
kind: other
id: Properties.T:Autodesk.Revit.DB.FilterStringBeginsWith
source: html/89ba9473-9d91-e6cf-cba9-51e344460545.htm
---
# FilterStringBeginsWith Properties

Specifies whether the .NET object represents a valid Revit entity.